Repository: pikougi-nabot/epochrefs-old
Catalog: commit/84000/data-translation-memory/toh44-45_84000-the-stem-array.tmx/chapters-54-56.tmx
Source language: bo
Languages: en

source: །བྱང་ཆུབ་སེམས་དཔའ་ཆེ་གེ་མོ་ཞིག་ནི། ཚུལ་ཁྲིམས་སྲུང་ངོ་། །བཟོད་པ་སྒོམ་མོ། །བརྩོན་འགྲུས་རྩོམ་མོ། །བསམ་གཏན་ལ་སྙོམས་པར་འཇུག་གོ །ཤེས་རབ་ཀྱིས་རྣམ་པར་དབྱེ་བ་ལ་བརྩོན་ནོ།
en: that a bodhisattva with such and such a name maintains correct conduct, meditates on patience, engages in diligence, rests in dhyāna, or practices the analysis of wisdom;

source: །བྱང་ཆུབ་སེམས་དཔའ་ཆེ་གེ་མོ་ཞིག་ནི་དམ་པའི་ཆོས་ཡོངས་སུ་བཙལ་བའི་དོན་དུ་རྒྱལ་པོའི་སྲིད་ཡོངས་སུ་གཏོང་བར་བྱེད་དོ།
en: that a bodhisattva with such and such a name gives away his kingdom in order to search for the Dharma;

source: །རིན་པོ་ཆེ་ཡོངས་སུ་གཏོང་བ་དང་། བུ་ཡོངས་སུ་གཏོང་བ་དང་། ཆུང་མ་ཡོངས་སུ་གཏོང་བ་དང་། རྐ་ལག་དང་མྱིག་དང་། མགོ་ཡོངས་སུ་གཏོང་བ་བྱེད་དོ། །མྱེར་མཆོང་བ་བྱེད་དོ།
en: that he gives away his jewels, gives away his children, gives away his wives, gives away his hands and feet, gives away his head, and jumps into fire;

source: །བྱང་ཆུབ་སེམས་དཔའི་མིང་དང་ཆེ་གེ་མོ་ཞིག་གིས་ནི་དེ་བཞིན་གཤེགས་པའི་བསྟན་པ་བཟུང་སྟེ། ཆོས་སྨྲ་བར་བྱེད་དོ། །ཆོས་ཀྱི་སྦྱིན་པ་གཏོང་ངོ་། །ཆོས་ཀྱི་མཆོད་སྦྱིན་བྱེད་དོ། །ཆོས་ཀྱི་རྒྱལ་མཚན་སྒྲེང་ངོ་། །ཆོས་ཀྱི་རྔ་རྡུང་ངོ་། །ཆོས་ཀྱི་དུང་འབུད་དོ། །ཆོས་ཀྱི་ཆར་འབེབས་སོ། །དེ་བཞིན་གཤེགས་པའི་བསྟན་པ་འཛིན་ཏོ། །དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་བརྒྱན་པ་བྱེད་དོ། །དེ་བཞིན་གཤེགས་པའི་སྐུ་གཟུགས་བརྒྱན་པ་བྱེད་དོ། །སེམས་ཅན་ལ་བདེ་བའི་ཡོ་བྱད་ཀྱིས་སྡུད་དོ། །དམ་པའི་ཆོས་ཀྱི་མཛོད་སྲུང་ངོ་ཞེས་བྱ་བའི་སྒྲ་ཐོས་སོ།
en: that a bodhisattva with such and such a name holds the teaching of a tathāgata, recites the Dharma, makes a gift of the Dharma, makes an offering of the Dharma, raises the banner of the Dharma, beats the drum of the Dharma, blows the conch of the Dharma, sends down a rain of the Dharma, holds the teaching of a tathāgata, adorns the caitya of the Tathāgata, adorns the image of the Tathāgata, gathers the articles that will bring happiness to beings, and guards the treasure of the Dharma.

source: །ལ་ལ་ལས་ནི་འཇིག་རྟེན་གྱི་ཁམས་ཆེ་གེ་མོ་ཞིག་ཅེས་བྱ་བ་ན། དེ་བཞིན་གཤེགས་པ་མཚན་ཆེ་གེ་མོ་ཞེས་དབང་བསྐུར་བ་མྱིང་དང་ཆེ་གེ་མོ་ཞིག་གིས་འཁོར་འདི་ལྟ་བུ་ཞིག་ན་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ལྟ་བུ་ཞིག་དང་། བསྐལ་པ་འདི་ལྟ་བུ་ཞིག་ལ་སྐུ་ཚེའི་ཚད་འདི་ཙམ་ཞིག་དང་ཆོས་བསྟན་པ་འདི་ལྟ་བུ་དང་། སེམས་ཅན་འདུལ་བ་འདི་འདྲ་བ་དང་། འདི་ལྟ་བུའི་སྨོན་ལམ་གྱི་མངོན་པར་འཚང་རྒྱ་བས་ད་ལྟར་བཞུགས་ཤིང་འཚོ་སྐྱོང་ངོ་ཞེས་བྱ་བ་དང་། དེ་བཞིན་དུ་དྲིལ་དང་དྲིལ་བུ་གཡེར་ཀའི་དྲ་བ་དང་། རོལ་མོ་ལ་སྩོགས་པའི་དམིགས་པ་ཐམས་ཅད་ལས་ཆོས་ཀྱི་སྒོ་རྣམ་པ་ཐ་དད་པ་ཚད་མེད་པའི་སྒྲ་ཐོས་པར་གྱུར་ཏེ།
en: From some, he heard that in a world realm of such and such a name, there resided, lived, and remained a tathāgata with such and such a name, teaching the Dharma through a consecration with a certain name, to a certain assembly, in a certain buddha realm, in a certain kalpa, with a certain lifespan, with certain Dharma teachings, guiding beings in a certain way, and having attained buddhahood through certain prayers. In that way, he heard from all the perceived networks of bells and jingle bells, music, and so on the words of countless different kinds of Dharma doors.

source: སྒྲ་དེ་དག་ཐམས་ཅད་ཐོས་པས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་དགའ་བའི་ཤུགས་རྒྱ་ཆེན་པོས་མངོན་པར་བརླན་པའི་སེམས་ཀྱིས་ཆོས་ཀྱི་སྒོ་དེ་དག་ཐོས་ནས་ལ་ལར་ནི་གཟུངས་ཀྱི་སྒོ་མང་པོ་ཐོབ་པར་གྱུར་ཏོ།
en: On hearing all those words, the mind of Sudhana, the head merchant’s son, became saturated with the vast power of joy and attained, through hearing, those Dharma doors.

source: །ལ་ལར་ནི་སྤོབས་པའི་སྒོ་མང་པོ་ཐོབ་པར་གྱུར་ཏོ།
en: On hearing some, he attained many doors of eloquence.

source: །ལ་ལར་ནི་བཟོད་པའི་སྒོ་མང་པོ་ཐོབ་པར་གྱུར་ཏོ།
en: On hearing some, he attained many doors of the power of patience.

source: །ལ་ལར་ནི་སྤྱོད་པའི་སྒོ་མང་པོ་ཐོབ་པར་གྱུར་ཏོ།
en: On hearing some, he attained many doors of conduct.

source: །ལ་ལར་ནི་སྨོན་ལམ་གྱི་སྒོ་མང་པོ་ཐོབ་པར་གྱུར་ཏོ།
en: On hearing some, he attained many doors of prayer.

source: །ལ་ལར་ནི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་མང་པོ་ཐོབ་པར་གྱུར་ཏོ།
en: On hearing some, he attained many doors of the perfections.

source: །ལ་ལར་ནི་མངོན་པར་ཤེས་པའི་སྒོ་མང་པོ་ཐོབ་པར་གྱུར་ཏོ།
en: On hearing some, he attained many doors of the higher cognitions.

source: །ལ་ལར་ནི་རིག་པ་དང་ཡེ་ཤེས་སྣང་བའི་སྒོ་མང་པོ་ཐོབ་པར་གྱུར་ཏོ།
en: On hearing some, he attained many doors of gnosis and knowledge.

source: །ལ་ལར་ནི་རྣམ་པར་ཐར་པའི་སྒོ་མང་པོ་ཐོབ་པར་གྱུར་ཏོ།
en: On hearing some, he attained many doors of liberations.

source: །ལ་ལར་ནི་ཏིང་ངེ་འཛིན་གྱི་སྒོར་འཇུག་པ་མང་པོ་ཐོབ་པར་གྱུར་ཏོ།། །།སངས་རྒྱས་རྨད་གཅད་ཅེས་བྱ་བ་ཤིན་ཏུ་རྒྱས་པ་ཆེན་པོའི་མདོ། བམ་པོ་ཉི་ཤུ་གཅིག་པ།
en: On hearing some, he attained many doors of samādhis.

source: མེ་ལོང་གི་དཀྱིལ་འཁོར་དེ་དག་ལས་ཀྱང་གཟུགས་བརྙན་གྱི་རྒྱན་རྣམ་པར་དམིགས་པ་ཚད་མེད་པ་མཐོང་བར་གྱུར་ཏེ།
en: He saw in the mirrors countless reflections of images.

source: ལ་ལར་ནི་དེ་བཞིན་གཤེགས་པའི་འཁོར་གྱི་དཀྱིལ་འཁོར་གྱི་གཟུགས་བརྙན་རྣམ་པར་དམིགས་པ་མཐོང་ངོ་།
en: In some he saw the perception of the reflections of the assemblies of followers of tathāgatas; in some he saw the perception of the reflections of the assemblies of followers of bodhisattvas; in some, the perception of the reflections of the assemblies of followers of śrāvakas; in some, the perception of the reflections of the assemblies of followers of pratyeka­buddhas; in some, the perception of the reflections of the assemblies of followers of tathāgatas; in some, the perception of the reflections of defiled realms;

source: །ལ་ལར་ནི་བྱང་ཆུབ་སེམས་དཔའི་འཁོར་གྱི་དཀྱིལ་འཁོར་གྱི་གཟུགས་བརྙན་རྣམ་པར་དམིགས་པ་དང་། ལ་ལར་ནི་ཉན་ཐོས་ཀྱི་འཁོར་གྱི་དཀྱིལ་འཁོར་གྱི་གཟུགས་བརྙན་རྣམ་པར་དམིགས་པ་དང་། ལ་ལར་ནི་རང་སངས་རྒྱས་ཀྱི་འཁོར་གྱི་དཀྱིལ་འཁོར་གྱི་གཟུགས་བརྙན་རྣམ་པར་དམིགས་པ་དང་། ལ་ལར་ནི་དེ་བཞིན་གཤེགས་པའི་འཁོར་གྱི་དཀྱིལ་འཁོར་གྱི་གཟུགས་བརྙན་རྣམ་པར་དམིགས་པ་དང་། ལ་ལར་ནི་ཀུན་ནས་ཉོན་མོངས་པའི་ཞིང་གི་གཟུགས་བརྙན་རྣམ་པར་དམིགས་པ་དང་། ལ་ལར་ནི་རྣམ་པར་དག་པའི་ཞིང་གི་གཟུགས་བརྙན་རྣམ་པར་དམིགས་པ་དང་། ལ་ལར་ནི་ཀུན་ནས་ཉོན་མོངས་ཤིང་རྣམ་པར་དག་པའི་ཞིང་གི་གཟུགས་བརྙན་རྣམ་པར་དམིགས་པ་དང་། ལ་ལར་ནི་རྣམ་པར་དག་ཅིང་ཀུན་ནས་ཉོན་མོངས་པའི་ཞིང་གི་གཟུགས་བརྙན་རྣམ་པར་དམིགས་པ་དང་། ལ་ལར་ནི་སངས་རྒྱས་དང་བཅས་པའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་གཟུགས་བརྙན་རྣམ་པར་དམིགས་པ་དང་། ལ་ལར་ནི་སངས་རྒྱས་མི་བཞུགས་པའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་གཟུགས་བརྙན་རྣམ་པར་དམིགས་པ་དང་། ལ་ལར་ནི་ཆུང་བའི་འཇིག་རྟེན་ཀྱི་ཁམས་ཀྱི་གཟུགས་བརྙན་རྣམ་པར་དམིགས་པ་དང་། ལ་ལར་ནི་ཆེ་བའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་གཟུགས་བརྙན་རྣམ་པར་དམིགས་པ་དང་། ལ་ལར་ནི་ཕྲ་བའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་གཟུགས་བརྙན་རྣམ་པར་དམིགས་པ་དང་། ལ་ལར་ནི་རྒྱ་ཆེ་བའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་གཟུགས་བརྙན་རྣམ་པར་དམིགས་པ་དང་། ལ་ལར་ནི་མྱིག་འཕྲུལ་གྱིས་འཇུ་ག་པའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་གཟུགས་བརྙན་རྣམ་པར་དམིགས་པ་དང་། ལ་ལར་ནི་སྣྲེལ་ཞིའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་གཟུགས་བརྙན་རྣམ་པར་དམིགས་པ་དང་། ལ་ལར་ནི་སྤྱིའུ་ཚུགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་གཟུགས་བརྙན་རྣམ་པར་དམིགས་པ་དང་། ལ་ལར་ནི་སའི་གཞི་མཉམ་པར་འདུག་པའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་གཟུགས་བརྙན་རྣམ་པར་དམིགས་པ་དང་། ལ་ལར་ནི་སེམས་ཅན་དམྱལ་བ་དང་། བྱོལ་སོང་དང་། ཡི་དྭགས་ཀྱི་གནས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་གཟུགས་བརྙན་རྣམ་པར་དམིགས་པ་དང་། ལ་ལར་ནི་ལྷ་དང་མྱིས་གང་བའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་གཟུགས་བརྙན་རྣམ་པར་དམིགས་པ་མཐོང་བར་གྱུར་ཏོ།
en: in some, the perception of the reflections of pure realms; in some, the perception of the reflections of defiled pure realms; in some, the perception of the reflections of purified defiled realms; in some, the perception of the reflections of world realms with buddhas; in some, the perception of the reflections of world realms without the presence of a buddha; in some, the perception of the reflections of small world realms; in some, the perception of the reflections of great world realms; in some, the perception of the reflections of narrow world realms; in some, the perception of the reflections of vast world realms; in some, the perception of the reflections of world realms that were within magical illusion; in some, the perception of the reflections of world realms that were sideways; in some, the perception of the reflections of world realms that were upside-down; in some, the perception of the reflections of world realms that were level ; in some, the perception of the reflections of world realms that were the abodes of the hell beings, animals, and pretas; and in some, the perception of the reflections of world realms filled with devas and humans.

source: །འཆག་ས་དེ་དག་དང་། གནས་དེ་དག་དང་། སྟན་དེ་དག་ལ་བྱང་ཆུབ་སེམས་དཔའ་གྲངས་མེད་པ་དགོས་པ་སྣ་ཚོགས་ལ་བརྩོན་པ་དག་ཀྱང་མཐོང་བར་གྱུར་ཏེ།
en: He also saw countless bodhisattvas on the walkways and seated on the thrones dedicated to a variety of necessities:

source: ལ་ལར་ནི་འཆག་པ་དང་། ལ་ལར་ནི་བསམ་གཏན་བྱེད་པ་དང་། ལ་ལར་ནི་ལྟ་བ་དང་། ལ་ལར་ནི་སེམས་ཅན་རྣམས་ལ་སྙིང་རྗེ་ཆེན་པོས་རྒྱས་པར་འགེངས་པ་དང་། ལ་ལར་ནི་གཙུག་ལག་གི་ཚུལ་སྣ་ཚོགས་འཇིག་རྟེན་གྱི་དོན་དུ་འགྱུར་བ་བསྒྲུབ་པ་དང་། ལ་ལར་ནི་ལུང་ནོད་པ་དང་། ལ་ལར་ནི་ཁ་ཏོན་བྱེད་པ་དང་། ལ་ལར་ནི་ཡི་གེར་འདྲི་བ་དང་། ལ་ལར་ནི་དྲི་བ་ཡོངས་སུ་འདྲི་བ་དང་། ལ་ལར་ནི་ཕུང་པོ་གསུམ་པའི་བཤགས་པ་དང་། ཡོངས་སུ་བསྔོ་བ་ལ་བརྩོན་པ་དང་། ལ་ལར་ནི་སྨོན་ལམ་མངོན་པར་སྒྲུབ་པ་བྱེད་པ་མཐོང་ངོ་།
en: some were walking, some were in meditation, some were looking, some were filled great compassion for beings, some were composing treatises on various subjects in order to benefit the world, some were receiving scriptural transmission, some were chanting it, some were writing it, some were asking questions, some were dedicated to The Confession of the Three Heaps and to dedication prayers, and some were accomplishing prayers. He saw many nets of light of all the kings of jewels coming from the pillars: from some came blue lights; from some, yellow; from some, red; from some, white;

source: །ཀ་བ་དེ་དག་ལས་ཀྱང་རིན་པོ་ཆེའི་རྒྱལ་པོ་ཐམས་ཅད་ཀྱི་འོད་ཀྱི་དྲ་བ་མང་པོ་འབྱུང་བ་མཐོང་སྟེ།
en: from some, the color of crystal; from some, the color of gold;

source: ལ་ལ་ལས་ནི་ཁ་དོག་སྔོན་པོ་དང་། ལ་ལ་ལས་ནི་ཁ་དོག་སེར་པོ་དང་། ལ་ལ་ལས་ནི་ཁ་དོག་དམར་པོ་དང་། ལ་ལ་ལས་ནི་ཁ་དོག་དཀར་པོ་དང་། ལ་ལ་ལས་ནི་ཤེལ་གྱི་ཁ་དོག་དང་། ལ་ལ་ལས་ནི་གསེར་གྱི་ཁ་དོག་དང་། ལ་ལ་ལས་ནི་ཨིན་དྲ་ནཱི་ལའི་ཁ་དོག་དང་། ལ་ལ་ལས་ནི་འཇའི་ཁ་དོག་དང་། ལ་ལ་ལས་ནི་འཛམ་བུ་ཆུ་ཀླུང་གི་གསེར་གྱི་ཁ་དོག་དང་། ལ་ལས་ནི་འོད་ཐམས་ཅད་དུ་སྣང་བའི་ཁ་དོག་དང་། ལུས་དང་སེམས་ཀྱི་བདེ་བསྐྱེད་པ་བལྟ་ན་མཆོག་ཏུ་མཛེས་པ་མཐོང་བར་གྱུར་ཏོ།
en: from some, the color of sapphire; from some, the colors of the rainbow; from some, the color of Jambu River gold; and from some, lights in every color; which brought happiness to the body and mind and were supremely beautiful.

source: །འཛམ་བུ་ཆུ་ཀླུང་གི་གསེར་གྱི་ཆུ་ཤིང་གི་ཀ་བ་དེ་དག་དང་། རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་གཟུགས་དེ་དག་ཀྱང་ལག་ནས་མེ་ཏོག་གི་སྤྲིན་མངོན་པར་སྤྱོད་པར་མཐོང་སྟེ།
en: He saw that the pillars of banana trees made of Jambu River gold and the hands of the statues made of all precious materials were hung with clouds of flowers, and he saw that the hands were hung with wreaths of garlands; the hands were draped with cloths; the hands held parasols, banners, and flags;

source: ལག་ནས་ཕྲེང་བའི་ལྡ་ལྡི་དང་། ལག་ནས་གོས་དང་། ལག་ནས་གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དང་། ལག་ནས་སྤོས་དང་། བདུག་སྤོས་དང་། བྱུག་པ་དང་། ལག་ནས་ནོར་བུ་རིན་པོ་ཆེའི་དྲ་བ་དང་། ལག་ནས་རིན་པོ་ཆེ་སྣ་ཚོགས་དང་། གསེར་གྱི་ལྕག་ཕོད་སྣ་ཚོགས་དང་། ལག་ནས་མུ་ཏིག་སྣ་ཚོགས་ཀྱི་སེ་མོ་དོ་དང་། ལག་ནས་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་སེ་མོ་དོ་མངོན་པར་སྦྱོང་བ་དང་། ལག་ན་རྒྱན་ཐམས་ཅད་ཐོགས་པར་མཐོང་ངོ་།
en: the hands held perfumes, incense, and ointments; the hands were hung with nets of strings of precious jewels; the hands were hung with various jewels on various cords of gold; the hands were hung with long necklaces of various pearls; the hands were hung with long necklaces of various jewels; the hands were holding all kinds of adornments.

source: །ལ་ལ་ནི་གཙུག་གི་རིན་པོ་ཆེ་དང་། ཅོད་པན་གྱིས་འདུད་ཅིང་མྱིག་མྱི་འགེབས་པར་བལྟ་བ་དང་། ཐལ་མོ་སྦྱར་ཞིང་ཕྱག་འཚལ་བར་མཐོང་ངོ་། །མུ་ཏིག་གི་ཕྲེང་བ་དེ་དག་ལས་ཀྱང་།
en: He saw that some were bowing down their topknot jewels and crowns, staring with unblinking eyes, and paying homage with their palms placed together.

source: སྤོས་སྣ་ཚོགས་ཀྱིས་དྲི་ཞིམ་པོར་བྱས་པའི་ཆ་ཡན་ལག་བརྒྱད་དང་ལྡན་པའི་ཆར་གྱི་རྒྱུན་ཕྲ་མོ་འབབ་པར་མཐོང་ངོ་། །རིན་པོ་ཆེ་བཻ་ཌཱུརྱའི་ཕྲེང་བའི་དྲ་བ་དེ་དག་ལས་ཀྱང་།
en: He saw that from the strings of pearls fell a gentle rain of water with the eight good qualities that had the lovely aroma of various scents.

source: མར་མྱེའི་ཕྲེང་བ་རབ་ཏུ་འབར་བ་མང་པོ་མཐོང་བར་གྱུར་ཏོ།
en: He saw many shining rows of lamps come from the nets of strings of beryl jewels.

source: །རིན་པོ་ཆེའི་གདུགས་དེ་དག་ཀྱང་རྒྱན་དང་། ལྷབ་ལྷུབ་ཐམས་ཅད་ཀྱིས་མཛེས་པར་བརྒྱན་ཏེ།
en: He saw the precious parasols adorned by every kind of adornment and decoration.

source: རིན་པོ་ཆེའི་དྲིལ་དང་། དྲིལ་བུ་གཡེར་ཁའི་དྲ་བ་དང་། དར་གྱི་ལྡ་ལྡི་དང་། ཆུན་པོ་དང་། རིན་པོ་ཆེའི་ཤར་བུ་དང་། ནོར་བུ་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱིས་སྒོ་ངས་ཡོངས་སུ་བརྒྱན་པའི་སྙིང་པོ་དང་ལྡན་པ་མཐོང་ངོ་། །རྫིང་དེ་དག་ནས་ཀྱང་།
en: He saw their interiors adorned by precious bells, nets of jingle bells, silk streamers and tassels, precious tablets, and eggs made of various kinds of precious jewels.

source: རིན་པོ་ཆེའི་མེ་ཏོག་པད་མོ་དང་། ཨུཏ་པལ་དང་། ཀུ་མ་ད་དང་། བུན་ད་རི་ཀ་གྲངས་མེད་པ་མངོན་པར་འཐོན་པར་མཐོང་སྟེ།
en: He saw the ponds in which arose countless precious red lotuses, blue lotuses, night lotuses, and white lotuses.

source: ལ་ལ་ནི་མཐོ་གང་འཁོར་བ་ཙམ། ལ་ལ་ནི་འདོམ་གང་འཁོར་བ་ཙམ། ལ་ལ་ནི་ཤིང་རྟའི་འཁོར་ལོ་ཙམ་སྟེ། དེ་དག་ལ་ཡང་གཟུགས་སྣ་ཚོགས་ཀྱི་རྒྱན་མང་པོ་འཁོད་པར་མཐོང་སྟེ།
en: He saw that some were a hand span in size, some were a fathom in circumference, some were the size of carriage wheels, on which were arrayed the adornments of various statues.

source: འདི་ལྟར་བུད་མེད་ཀྱི་གཟུགས་དང་། སྐྱེས་པའི་གཟུགས་དང་། ཁྱེའུའི་གཟུགས་དང་། བུ་མོའི་གཟུགས་དང་། བརྒྱ་བྱིན་གྱི་གཟུགས་དང་། ཚངས་པའི་གཟུགས་དང་། འཇིག་རྟེན་གྱི་མགོན་པོའི་གཟུགས་དང་། ལྷ་དང་ཀླུ་དང་། གནོད་སྦྱིན་དང་དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མི་འམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོའི་གཟུགས་དང་། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའི་གཟུགས་དང་། འགྲོ་བ་ཐམས་ཅད་ཀྱི་གཟུགས་ཀྱི་དབྱིབས་སུ་འདུག་པའི་ལུས་ཁ་དོག་སྣ་ཚོགས་རྣམ་པ་དུ་མ་དང་ལྡན་པ་མང་པོ་ཐལ་མོ་སྦྱར་ཏེ། ལུས་འདུད་ཅིང་།
en: He saw that there were statues of women, statues of men, statues of boys, statues of girls, statues of Śakra, statues of Brahmā, statues of the world lords, and statues of devas, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, mahoragas, śrāvakas, pratyeka­buddhas, and bodhisattvas, and also statues in the form of all beings with their many various colors and bodies, all arranged paying homage, with their palms together and bowing their bodies.

source: ཕྱག་འཚལ་བར་འཁོད་པར་མཐོང་ངོ་། །དེ་བཞིན་གཤེགས་པའི་སྐུ་གཟུགས། མྱི་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་ཀྱིས་བརྒྱན་པ་སྐྱིལ་མོ་ཀྲུང་དུ་བཅས་ཏེ་བཞུགས་པ་དག་ཀྱང་མཐོང་ངོ་།
en: He also saw statues of tathāgatas adorned with the thirty-two signs of a great being and sitting cross-legged.

source: །ས་ཆེན་པོའི་གཞི་བཻ་ཌཱུརྱ་ལས་གྲུབ་པ། མྱིག་མངས་རིས་སུ་འདུག་པའི་མྱིག་མངས་རིས་རེ་རེ་ནས་ཀྱང་གཟུགས་བརྙན་རྣམ་པར་དམྱིགས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་མང་པོ་མཐོང་བར་གྱུར་ཏེ། །ཁང་བ་རྩེགས་པ།
en: He saw that the floor was a great ground made of beryl with a checkerboard pattern, and within each of the squares there were countless perceptions of reflections.

source: ལ་ལ་ལས་ནི་ཞིང་གི་གཟུགས་བརྙན་རྣམ་པར་དམིགས་པ།
en: In some, he saw the perception of reflections of realms;

source: ལ་ལ་ལས་ནི་བྱང་ཆུབ་སེམས་དཔའི་གཟུགས་བརྙན་རྣམ་པར་དམིགས་པ།
en: in some, the perception of reflections of bodhisattvas;

source: ལ་ལ་ལས་ནི་སངས་རྒྱས་ཀྱི་གཟུགས་བརྙན་རྣམ་པར་དམིགས་པ་མཐོང་བར་གྱུར་ཏེ།
en: and in some, the perception of reflections of buddhas.

source: ཁང་པ་བརྩེགས་པ་དེ་དག་གི་རྒྱན་དང་། ལྷབ་ལྷུབ་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་ཀྱང་། མྱིག་མངས་རིས་རེ་རེ་ལ་གཟུགས་བརྙན་དུ་སྣང་བར་མཐོང་ངོ་།
en: He saw that reflections of the entire array of the adornments in the kūṭāgāras appeared in each of the squares.

source: །རིན་པོ་ཆེའི་ཤིང་རིན་པོ་ཆེའི་མེ་ཏོག་དང་། འབྲས་བུའི་མཛོད་སྣ་ཚོགས་དང་ལྡན་པ་དེ་དག་ཐམས་ཅད་ལས་ཀྱང་། ལུས་ཕྱེད་ཙམ་བྱུང་བའི་གཟུགས་དབྱིབས་སྣ་ཚོགས་དང་ཁ་དོག་སྣ་ཚོགས་སུ་འདུག་པ་མང་པོ་འཐོན་པར་མཐོང་སྟེ།
en: He saw that from out of the entire treasury of the various flowers and fruits of the precious trees emerged the upper halves of many bodies with various shapes and various colors. He saw that from some emerged the upper halves of the bodies of buddhas;

source: ལ་ལ་ལས་ནི་སངས་རྒྱས་སྐུ་ཕྱེད་ཙམ་བྱུང་བ་དང་། ལ་ལ་ལས་ནི་བྱང་ཆུབ་སེམས་དཔའི་ལུས་ཕྱེད་ཙམ་བྱུང་བ་དང་། ལ་ལ་ལས་ནི་ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མྱིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོའི་ལུས་ཕྱེད་ཙམ་བྱུང་བ་དང་། ལ་ལ་ལས་ནི་བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། འཇིག་རྟེན་གྱི་མགོན་པོའི་ལུས་ཕྱེད་ཙམ་བྱུང་བ་དང་། ལ་ལ་ལས་ནི་འཁོར་ལོས་སྒྱུར་བ་དང་། མྱིའི་དབང་པོའི་ལུས་ཕྱེད་ཙམ་བྱུང་བ་དང་། ལ་ལ་ལས་ནི་རྒྱལ་བུ་གཞོན་ནུ་དང་། ཚོང་དཔོན་དང་། ཁྱིམ་བདག་དང་། བློན་པོ་དང་། སྐྱེས་པ་དང་། བུད་མེད་དང་། ཁྱེའུ་དང་། དགེ་སློང་དང་། དགེ་སློང་མ་དང་། དགེ་བསྙེན་དང་། དགེ་བསྙེན་མའི་ལུས་ཕྱེད་ཙམ་བྱུང་བ་མཐོང་སྟེ།
en: from some emerged the upper halves of the bodies of bodhisattvas; from some emerged the upper halves of the bodies of devas, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, and mahoragas; from some emerged the upper halves of the bodies of Śakra, Brahmā, and world lords; from some emerged the upper halves of the bodies of cakravartins and lords of humans; from some emerged the upper halves of the bodies of young princes, head merchants, householders, ministers, men, women, boys, girls, bhikṣus, bhikṣuṇīs, upāsakas, and upāsikās.

source: ལ་ལའི་ལ་གནས་ནི་མེ་ཏོག་ཕྲེང་བ་སྤྱོད་པ་དང་། ལ་ལའི་ལག་ནས་ནི་རིན་པོ་ཆེའི་ཕྲེང་བ་མངོན་པར་སྤྱོད་པ་དང་། ལ་ལའི་ལག་ནས་ནི་རྒྱན་ཐམས་ཅད་མངོན་པར་ཐོགས་པ་དང་། ལ་ལ་ནི་ལུས་འདུད་ཅིང་ཐལ་མོ་སྦྱར་ཏེ་མྱིག་མི་འགེབས་པར་ལྟ་ཞིང་ཕྱག་འཚལ་བ་དང་། ལ་ལ་ནི་མངོན་པར་བསྟོད་པ་དང་། ལ་ལ་ནི་མཉམ་པར་བཞག་པ་དང་། ལ་ལ་ནི་གསེར་གྱི་ཁ་དོག་ཏུ་འདུག་པ་དང་། ལ་ལ་ནི་དངུལ་གྱི་ཁ་དོག་ཏུ་འདུག་པ་དང་། ལ་ལ་ནི་བྱི་རུའི་ཁ་དོག་ཏུ་འདུག་པ་དང་། ལ་ལ་ནི་རིན་པོ་ཆེ་བཻཌཱུརྱ་སྔོན་པོའི་ཁ་དོག་ཏུ་འདུག་པ་དང་། ལ་ལ་ནི་རིན་པོ་ཆེ་ཨིན་དྲ་ནཱི་ལའི་ཁ་དོག་ཏུ་འདུག་པ་དང་། ལ་ལ་ནི་ནོར་བུ་རིན་པོ་ཆེ་རྣམ་པར་སྣང་བའི་ཁ་དོག་ཏུ་འདུག་པ་དང་། ལ་ལ་ནི་རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་ཁ་དོག་ཏུ་འདུག་པ་དང་། ལ་ལ་ནི་མེ་ཏོག་ཙམ་པ་ཀའི་ཁ་དོག་ཏུ་འདུག་པ་དང་། ལ་ལ་ནི་འོད་ཀྱི་ལུས་དང་། ལ་ལ་ནི་མཚན་གྱིས་རྣམ་པར་བྲིས་པའི་ལུས་སུ་མཐོང་བར་གྱུར་ཏོ།
en: He saw that some of them had flower garlands hanging from their hands; some of them had strings of jewels hanging from their hands; some of them had all adornments held in their hands; some were bowing, with palms together, and gazing with unblinking eyes; some were praising; some were resting in meditation; some were the color of gold; some were the color of silver; some were the color of coral; some were the color of blue beryl; some were the color of sapphires; some were the color of the radiance of vairocana jewels; some were the color of magnolia flowers; some had bodies of light; and some were beautified by the signs of a great being.

source: །ཟླ་གམ་དེ་དག་ལས་ཀྱང་གཉི་ཟླ་དང་གཟའ་སྐར་གྱི་གཟུགས་བརྙན་གྲངས་མེད་པ་མང་པོ་འཐོན་ཏེ།
en: He saw that from the half moons emerged countless reflections of suns, moons, planets, and stars.

source: ཕྱོགས་བཅུ་སྣང་བར་བྱེད་པ་མཐོང་བར་གྱུར་ཏོ། །ཁང་པ་དང་གཞལ་མེད་ཁང་དང་ཁང་པ་བརྩེགས་པའི་རྩིག་ངོས་དེ་དག་ཐམས་ཅད་ཀྱང་རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱིས་མྱིག་མངས་རིས་སུ་བྲིས་པར་མཐོང་སྟེ།
en: He saw that on all the walls of the buildings, divine palaces, and kūṭāgāras there were checkerboard patterns made of all jewels.

source: རིན་པོ་ཆེའི་མྱིག་མངས་རིས་དེ་དག་ཐམས་ཅད་ལས་ཀྱང་། བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་རིམ་པས་ཇི་ལྟར་སྤྱད་པའི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཐམས་ཅད་རིམ་པར་མཐོང་བར་གྱུར་ཏེ།
en: He saw within those jewel checkerboard patterns all the bodhisattva Maitreya’s stages of bodhisattva conduct in his past practice of bodhisattva conduct;

source: མིག་མངས་རིས་ལ་ལ་ལས་ནི་བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པས་མགོ་བྱིན་པ་མཐོང་ངོ་།
en: in some of the squares he saw the bodhisattva Maitreya giving away his head; in some, giving away his eyes; in some, giving away his hands; in some, giving away his clothes; in some, giving away his crest jewel; in some, giving away his crest jewel of righteousness; in some, giving away his teeth; in some, giving away his tongue; in some, giving away his ears; in some, giving away his nose; in some, giving away his heart; in some, giving away his flesh and bone marrow; in some, giving away his blood; in some, giving away his skin and panniculus;

source: །ལ་ལ་ལས་ནི་མྱིག་བྱིན་པ་དང་། ལ་ལ་ལས་ནི་ལག་པ་བྱིན་པ་དང་། ལ་ལ་ལས་ནི་གཙུག་གི་རིན་པོ་ཆེ་བྱིན་པ་དང་། ལ་ལ་ལས་ནི་ཐོར་པག་དང་བཅས་པའི་གཙུག་གི་རིན་པོ་ཆེ་བྱིན་པ་དང་། ལ་ལ་ལས་ནི་སོ་བྱིན་པ་དང་། ལ་ལ་ལས་ནི་ལྕེ་བྱིན་པ་དང་། ལ་ལ་ལས་ནི་རྣ་བ་བྱིན་པ་དང་། ལ་ལ་ལས་ནི་སྣ་བྱིན་པ་དང་། ལ་ལ་ལས་ནི་སྙིང་བྱིན་པ་དང་། ལ་ལ་ལས་ནི་ཤ་དང་རྐང་བྱིན་པ་དང་། ལ་ལ་ལས་ནི་ཁྲག་བྱིན་པ་དང་། ལ་ལ་ལས་ནི་པགས་པ་དང་པྲི་བྱིན་པ་དང་། ལ་ལ་ལས་ནི་སེན་མོ་ཤ་དང་བཅས་པར་བྱིན་པ་དང་། ལ་ལ་ལས་ནི་དྲ་བར་འབྲེལ་བ་དང་། བཅས་པའི་སོར་མོ་བྱིན་པ་དང་། ལ་ལ་ལས་ནི་བུ་དང་། བུ་མོ་དང་ཆུང་མ་བྱིན་པ་དང་། ལ་ལ་ལས་ནི་རིན་པོ་ཆེའི་ཕུང་པོ་བྱིན་པ་དང་། ལ་ལ་ལས་ནི་གྲོང་དང་གྲོང་ཁྱེར་དང་། ལྗོངས་དང་ཡུལ་དང་ཁམས་དང་། རྒྱལ་པོའི་གནས་བྱིན་པ་དང་། ལ་ལ་ལས་ནི་འཛམ་བུའི་གླིང་བྱིན་པ་དང་། ལ་ལ་ལས་ནི་གླིང་བཞི་བྱིན་པ་དང་། ལ་ལ་ལས་ནི་རྒྱལ་སྲིད་ཀྱི་དབང་ཕྱུག་བྱིན་པ་དང་། ལ་ལ་ལས་ནི་རྒྱལ་པོའི་ཁྲི་བྱིན་པ་དང་། ལ་ལ་ལས་ནི་བྲན་ཕོ་སྨོས་བྱིན་པ་དང་། ལ་ལ་ལས་ནི་བཙུན་མོའི་འཁོར་བྱིན་པ་དང་། ལ་ལ་ལས་ནི་བཟའ་ཤིང་གི་ར་བ་དང་། དཀའ་ཐུབ་ཀྱི་ནགས་ཚལ་བྱིན་པ་དང་། ལ་ལ་ལས་ནི་གདུགས་དང་རྒྱལ་མཚན་དང་བ་དན་བྱིན་པ་དང་། ལ་ལ་ལས་ནི་མེ་ཏོག་དང་། ཕྲེང་བ་དང་། བྱུག་པ་བྱིན་པ་དང་། ལ་ལ་ལས་ནི་ནད་ཀྱི་རྩི་བྱིན་པ་དང་། ལ་ལ་ལས་ནི་ཁ་ཟས་དང་། སྐོམ་གྱི་རྣམ་པ་མང་པོ་བྱིན་པ་དང་། ལ་ལ་ལས་ནི་ཡོ་བྱད་ཐམས་ཅད་བྱིན་པ་དང་། ལ་ལ་ལས་ནི་གནས་ཐམས་ཅད་བྱིན་པ་དང་། ལ་ལ་ལས་ནི་གཞལ་བའི་སྣོད་རིན་པོ་ཆེས་གང་བ་བྱིན་པ་དང་། ལ་ལ་ལས་ནི་རིན་པོ་ཆེའི་ཤིང་རྟ་བྱིན་པ་དང་། ལ་ལ་ལས་ནི་བཙོན་ར་ན་འཁོད་པ་ཐར་བར་བྱེད་པ་དང་། ལ་ལ་ལས་ནི་གསད་པར་ཆད་པ་ལས་ཐར་བར་བྱེད་པ་དང་། ལ་ལ་ལས་ནི་བྱིས་པ་གསོ་བ་བྱེད་པ་དང་། ལ་ལ་ལས་ནི་ལམ་སྟོར་བ་ལ་ལམ་སྟོན་པ་དང་། ལ་ལ་ལས་ནི་མཉན་པར་གྱུར་ཏེ།
en: in some, giving away his fingernails and toenails with their flesh; in some, giving away his fingers with their connecting webs; in some, giving away his sons, daughters, and wives; in some, giving away heaps of jewels; in some, giving away villages, towns, districts, regions, realms, and royal capitals; in some, giving away Jambudvīpa; in some, giving away the power of sovereignty; in some, giving away the royal throne; in some, giving away his male and female slaves; in some, giving away his harem; in some, giving away his parks and forest groves; in some, giving away parasols, banners, and flags; in some, giving away flowers, garlands, perfumes, and ointments; in some, giving away healing medicines; in some, giving away much food and drink; in some, giving away all requisites; in some, giving away all shelters; in some, giving away white copper vessels filled with jewels; in some, giving away precious carriages; in some, freeing prisoners; in some, freeing those condemned to death; in some, curing children; and in some, showing the way to those who were lost;

source: ཆུ་ཀླུང་གི་རྒྱུད་ལ་གྲུ་འདོར་བ་དང་། ལ་ལ་ལས་ནི་རྟའི་རྒྱལ་པོ་སྟོབས་ཀྱིས་སྒྲོལ་བར་གྱུར་ཏེ།
en: in some, he was a ferryman who sailed his boat across the river;

source: རྒྱ་མཚོ་ཆེན་པོའི་སྲིན་པོའི་གླིང་དུ་ཕྱིན་པར་གྱུར་པའི་སེམས་ཅན་ཡོངས་སུ་སྐྱོབ་པ་དང་། ལ་ལ་ལས་ནི་དྲང་སྲོང་ཆེན་པོར་གྱུར་ཏེ།
en: in some, he was Bālāha, the king of horses, who saved the beings who had gone to the island of the rākṣasīs in the great ocean;

source: བསྟན་པ་མངོན་པར་བསྒྲུབ་པ་དང་། ལ་ལ་ལས་ནི་འཁོར་ལོས་སྒྱུར་བར་གྱུར་ཏེ།
en: in some, he was a great ṛṣi who created teaching traditions;

source: སེམས་ཅན་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ལ་དགོད་པ་དང་། ལ་ལ་ལས་ནི་སྨན་པར་གྱུར་ཏེ།
en: in some, he was a cakravartin who established beings on the path of the ten good actions; in some, he was a physician who healed sickness; in some, he was someone who honored his father and mother; in some, he was someone who revered kalyāṇamitras;
